RoanBrand/espix/loader/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
# Built like the kernel, for the largest size; the loader provisions the table.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="../partitions/esp32s3-16mb.csv"
#
# Deliberately no PSRAM. The loader never needs it, and without it one loader
# serves every module of a target regardless of PSRAM size or mode. It also
# finds the kernel and storage partitions by label at run time, so it does not
# depend on the partition layout either -- one loader per target, not per board.
#
CONFIG_SPIRAM=n
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

#
# Nothing in the loader is interactive: it runs for a few seconds, chooses an
# image and reboots. Asserts and the full printf formatter are weight it does
# not need, and every byte here is a byte the kernel cannot use.
#
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_DISABLE=y
CONFIG_NEWLIB_NANO_FORMAT=y

#
# The rootfs image is generated with --name-max=CONFIG_LITTLEFS_OBJ_NAME_LEN in
# the kernel project. littlefs refuses to mount when the image's stored name_max
# is *larger* than the mounter's, so this must be at least the kernel's value;
# a smaller one is the only way to get it wrong. 64 is the default on both sides.
#
CONFIG_LITTLEFS_OBJ_NAME_LEN=64

#
# esp_ota_set_boot_partition() writes otadata's state as set_new_state_otadata(),
# which is ESP_OTA_IMG_NEW only when rollback is enabled in the app doing the
# writing. Without it the loader leaves the installed kernel UNDEFINED, so the
# bootloader never marks it PENDING_VERIFY and a kernel that fails to come up is
# never rolled back. The kernel project already sets this; the loader writes the
# slot, so it needs it too.
#
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

#
# The loader runs for about a second and then reboots, so its output is only
# visible to someone watching UART right after a flash. It is still worth
# having: a short banner and a line per decision make the one component that
# chooses what boots no longer a black box.
#
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_ESP_ERR_TO_NAME_LOOKUP=y

#
# Writing the partition table is refused by default: main_flash_region_protected()
# returns ESP_ERR_NOT_SUPPORTED for an address outside any partition and
# CHECK_WRITE_ADDRESS turns that into abort(). The loader is the app that
# legitimately writes the table for the flash it finds.
#
CONFIG_SPI_FLASH_DANGEROUS_WRITE_ALLOWED=y
